[net]
mean = 0.4637419,0.47166784,0.48316576
std = 0.45211827,0.16890674,0.18645908
width = 256
height = 192
channels = 3

[convolutional]
filters=8
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=16
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=32
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[route]
from = 19

[convolutional]
size=1
stride=1
pad=0
filters=10
activation=linear

[route]
from = 29

[convolutional]
size=1
stride=1
pad=0
filters=10
activation=linear

[concat]
from = 31
oned = 1
