[net]
mean = 0.4637419,0.47166784,0.48316576
std = 0.45211827,0.16890674,0.18645908
width = 512
height = 384
channels = 3

[convolutional]
filters=8
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=16
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=32
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=16
size=1
stride=1
pad=0
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=32
size=1
stride=1
pad=0
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=1
stride=1
pad=0
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=64
size=1
stride=1
pad=0
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=256
size=3
stride=2
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=1
stride=1
pad=0
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=128
size=1
stride=1
pad=0
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=linear
hasBias = false

[batchnorm]
activation = leaky

[route]
from = 25

[convolutional]
size=1
stride=1
pad=0
filters=10
activation=linear

[route]
from = 35

[convolutional]
size=1
stride=1
pad=0
filters=10
activation=linear

[concat]
from = 37
oned = 1
